fun main()
{
    try
    {
        print("x:")
        var x= readLine()!!.toDouble()
        print("y:")
        var y= readLine()!!.toDouble()
        when(x>=-1.0&&x<=1.0&&y>=-1.0&&y<=1.0)
        {
            true-> println("Точка принадлежит заштрихованной части области примера А")
            false-> println("Точка не принадлежит заштрихованной части области примера А")
        }
        when(x>=-0.5&&x<=0.5&&y>=-2.0&&y<=2.0)
        {
            true-> println("Точка принадлежит заштрихованной части области примера Б")
            false-> println("Точка не принадлежит заштрихованной части области примера Б")
        }
        when(x>=-2.0&&x<=1.0&&y>=-1.0&&y<=1.0)
        {
            true-> println("Точка принадлежит заштрихованной части области примера В")
            false-> println("Точка не принадлежит заштрихованной части области примера В")
        }
    }catch (e:Exception)
    {
        print("Некоррекотный тип данных")
    }



}